//*************************************************************
//*** ΠΛΣ50 "Βασικές Εξειδικεύσεις σε Θεωρία και Λογισμικό" ***
//***                   Εργασία Ε01 - Θέμα 1                ***
//***                    Απλή Αριθμομηχανή                  ***
//***                     Ακ.έτος 2016-17                   ***
//***                                                       ***
//*************************************************************

#include <stdio.h>                  // Αρκεί η χρήση της καθιερωμένης βιβλιοθήκης

int main()
{
    char praksi;                    // Δήλωση της μεταβλητής χαρακτήρα που θα χρησιμοποιηθεί για την επιλογή της πράξης
    double arithmos1, arithmos2;    // Δήλωση των 2 μεταβλητών για τους 2 αριθμούς που θα συμμετάσχουν στις πράξεις (χρησιμοποιούμε double για χρήση και μεγαλύτερων αριθμών)

    printf("Dwse arithmo praksi arithmo:\n");                        // Εκτύπωση στην οθόνη του αιτήματος εισαγωγής των απαραίτητων στοιχείων
    scanf("%lf %c %lf", &arithmos1, &praksi, &arithmos2);            // Ανάγνωση των απαραίτητων εισηγμένων στοιχείων και καταχώρηση στις μεταβλητές

    if (praksi != '+' && praksi != '-' && praksi != '*' && praksi != '/')   // Περίπτωση δήλωσης μη επιτρεπτής πράξης και εκτύπωση μηνύματος λάθους
        printf("Lathos! Den epelekses epitrepti praksi!\n");
    else if (praksi == '/' && arithmos2 == 0)                               // Περίπτωση διαίρεσης με το μηδέν και εκτύπωση μηνύματος λάθους
        printf("Lathos! Epixeireis diairesi me to miden!\n");
    else if (praksi == '+')                                                 // Περίπτωση πρόσθεσης και εκτύπωση αποτελέσματος (όλα τα αποτελέσματα τα καθορίζουμε στα 2 δεκαδικά ψηφία)
        printf("Apotelesma = %.2lf\n", arithmos1 + arithmos2);
    else if (praksi == '-')                                                 // Περίπτωση αφαίρεσης και εκτύπωση αποτελέσματος
        printf("Apotelesma = %.2lf\n", arithmos1 - arithmos2);
    else if (praksi == '*')                                                 // Περίπτωση ποπλλαπλασιασμού και εκτύπωση αποτελέσματος
        printf("Apotelesma = %.2lf\n", arithmos1 * arithmos2);
    else                                                                    // Περίπτωση διαίρεσης και εκτύπωση αποτελέσματος (το if θα ήταν πλεονασμός αφού δεν έχει μείνει άλλη περίπτωση)
        printf("Apotelesma = %.2lf\n", arithmos1 / arithmos2);

    return 0;
}
