//*************************************************************
//*** ΠΛΣ50 "Βασικές Εξειδικεύσεις σε Θεωρία και Λογισμικό" ***
//***                   Εργασία Ε01 - Θέμα 3                ***
//***               Δυαδική αναπαράσταση αριθμού            ***
//***                     Ακ.έτος 2016-17                   ***
//***                                                       ***
//*************************************************************

#include <stdio.h>

int main()
{
    const int vasi = 2;         // Δήλωση μεταβλητής με σταθερή τιμή 2
    int dekadikos, trexwn;      // Δήλωση μεταβλητών

    printf("Dwse enan thetiko akeraio arithmo:\n");     // Μήνυμα εισαγωγής ακέραιου
    scanf("%d", &dekadikos);                            // Ανάγνωση εισηγμένου αριθμού

    while(dekadikos <= 0) {      // Όσο εισάγεται αρνητικός δεκαδικός ή μηδέν θα ζητείται νέος αριθμός και θα διαβάζεται εκ νέου
        printf("O arithmos prepei na einai thetikos akeraios, dwse ksana enan thetiko akeraio:\n");
        scanf("%d", &dekadikos);
    }
    // Όταν εισηχθεί θετικός ακέραιος ενεργοποιείται ο βρόγχος for για αρχική τιμή της ελεγχόμενης μεταβλητής του (trexwn) την τιμή του εισηγμένου ακέραιου δεκαδικού
    // Για όσο η τιμή του trexwn είναι μεγαλύτερη του μηδέν θα εκτελείται ο βρόγχος. Κατά την εκτέλεση θα ελέγχεται το υπόλοιπο της διαίρεσης της τιμής του trexwn με την vasi και
    // αν είναι ίσο με 1 θα εκτυπώνεται το 1 στην οθόνη, αλλιώς θα εκτυπώνεται το 0. Στη συνέχεια θα ορίζεται ως τιμή του trexwn το αποτέλεσμα της διαίρεσης του trexwn με την vasi.
    // Όταν η τιμή του trexwn μηδενιστεί θα σταματήσει η εκτέλεση του βρόγχου και θα τερματιστεί και το πρόγραμμα με επιτυχία.
    for (trexwn = dekadikos; trexwn > 0; trexwn /= vasi)
        (trexwn % vasi == 1) ? putchar('1') : putchar('0');

    return 0;
}
